load-tests/news.yml
config:
  target: "https://small.chelzoo.tech"
  plugins:
    html-reporter:
      output: "./artillery-report-news.html"

  phases:
    - duration: 60
      arrivalRate: 10

  thresholds:
    http.response_time.p95: ["<", 500]
    http.response_time.p99: ["<", 800]
    http.response_time.max: ["<", 1000]

scenarios:
  - name: News Page Load Test
    flow:
      - get:
          url: "/news/?page=4"